In [1]:
import sqlite3
db = sqlite3.connect('syudent_database.db')

In [9]:
cursor = db.cursor()

In [15]:
cursor.execute("CREATE table  student_data( phone_No INT primary key , email_id text , course_name text , fee_paid INT)")

In [16]:
with open ('DT_Students.csv','r') as file:   
    no_records = 0                         
    for row in file:
        cursor.execute("INSERT INTO student_data VALUES( ?,?,?,?)" , row.split(","))
        db.commit()
        no_records += 1

print(no_records , 'Records inserted')

20 Records inserted

# order by:
how to change the order of records

In [18]:
#how to change the order of records (increasing/decreasing)
result = cursor.execute("select * from student_data order by fee_paid")
for row in result:
    print(row)

(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776618, 'student18@gmail.com', 'Data Science', 140000)

In [19]:
result = cursor.execute("select * from student_data order by fee_paid desc")
for row in result:
    print(row)               #for decreasing order use DESC

(9988776618, 'student18@gmail.com', 'Data Science', 140000)
(9988776605, 'student5@gmail.com', 'Data Science', 133000)
(9988776621, 'student21@gmail.com', 'Data Science', 131000)
(9988776608, 'student8@gmail.com', 'Data Science', 129000)
(9988776616, 'student16@gmail.com', 'Data Science', 122500)
(9988776611, 'student11@gmail.com', 'Data Science', 41500)
(9988776620, 'student20@gmail.com', 'Inv Banking', 41500)
(9988776609, 'student9@gmail.com', 'Data Science', 40000)
(9988776604, 'student4@gmail.com', 'Digital Marketing', 38000)
(9988776606, 'student6@gmail.com', 'Data Science', 34000)
(9988776607, 'student7@gmail.com', 'Data Science', 33000)
(9988776610, 'student10@gmail.com', 'Data Analytics', 32500)
(9988776619, 'student19@gmail.com', 'Data Analytics', 32500)
(9988776612, 'student12@gmail.com', 'Digital Marketing', 31000)
(9988776617, 'student17@gmail.com', 'Data Science', 29000)
(9988776614, 'student14@gmail.com', 'Data Science', 24000)
(9988776623, 'student23@gmail.com', 'Data Science', 24000)
(9988776613, 'student13@gmail.com', 'Digital Marketing', 23000)
(9988776615, 'student15@gmail.com', 'Data Science', 23000)
(9988776622, 'student22@gmail.com', 'Data Science', 23000)

# update table - update the column value:
updating any value in the table

In [22]:
#single record update 
sql = "UPDATE student_data SET course_name = 'Data science' where phone_no = 9988776612"
cursor.execute(sql)

In [24]:
#check if the course_name executed for the particular number 
sql = "SELECT * from student_data where phone_no = 9988776612"
result = cursor.execute(sql)
for row in result:
    print(row)

(9988776612, 'student12@gmail.com', 'Data science', 31000)

In [33]:
#multiple condition
sql = "SELECT phone_no , course_name, fee_paid fROM student_data WHERE course_name = 'Data science ' AND fee_paid <= 50000"
result = cursor.execute(sql)
for row in result:
    print(row)

In [35]:
#multiple records updating using IN
sql = 'update student_data SET fee_paid = 140000 WHERE phone_no IN (9988776601 , 9988776623 , 9988776615)'
result = cursor.execute(sql)      # we r introducing in means in these no only

   #it will update the fee_paid to 140000 of student with these above phone_no

In [36]:
#verify if it is updated
result = cursor.execute("SELECT phone_no , fee_paid FROM student_data WHERE  phone_no IN (9988776601,9988776623,9988776615)")
for row in result:     #988776601 doesn't exist in student_data
    print(row)

(9988776615, 140000)
(9988776623, 140000)

# between :
update using between(this will update the records between the range given )

In [38]:
sql = "UPDATE student_data SET course_name = 'tableau' WHERE phone_no BETWEEN 9988776605 and 9988776608"
result = cursor.execute(sql) #here starting and ending no both are included

In [39]:
result = cursor .execute("select phone_no ,course_name from student_data where course_name = 'tableau'")
for row in result:
    print(row)

(9988776605, 'tableau')
(9988776606, 'tableau')
(9988776607, 'tableau')
(9988776608, 'tableau')

In [44]:
result = cursor.execute("SELECT phone_no , course_name from student_data where phone_no BETWEEN 9988776605 and 9988776608")
for row in result:
    print(row)

(9988776605, 'tableau')
(9988776606, 'tableau')
(9988776607, 'tableau')
(9988776608, 'tableau')

# min and max function:

In [46]:
#min
result = cursor.execute("SELECT MIN(fee_paid) from student_data")
print ('minimun student_fee =', result.fetchone() )
#here fetchone is used for fetching only one data eg there are a lot of student who paid 23000
#there are multiple same no but fetch one
#with min and max always use a column with a numerical value


#max
result = cursor.execute("SELECT MAX(fee_paid) from student_data")
print('maximum fees =' , result.fetchone())

minimun student_fee = (23000,)
maximum fees = (140000,)

delete records = how to delete unwanted records 
in data science deleting any records is not done by us

In [ ]:
# sql = "delete from student_data where phone_no = 9988776623"
cursor.execute(sql)
db.commit()   #it will not show anything because data is deleted 
# we used db.commit() because we bring some changes with this code

# subquery:
query inside another query is known as sub query
when we have data distributed in more than one table and we fetch data by using more than one table is when sub query is used

In [48]:
# select* from table_name1 where column name(s) = select column_name(s) from student_name2
           #query                               =     #subquery

In [55]:
db = sqlite3.connect("student_course_database.db")

In [53]:
cur = db.cursor()

In [54]:
cursor.execute("CREATE TABLE course1(course_id INT PRIMARY KEY , course_name text , duration int)")

In [56]:
cursor.execute("create table student1(roll_no int primary key ,student_name text , age int , course_id int , foreign key(course_id) references course1(course_id))")

In [57]:
#here course1 is child key while student1 is parent key

In [58]:
cursor.execute("INSERT INTO course1 VALUES(78 , 'data science' , 12) , (56 ,'python' , 6) , (101 , 'data base' ,10)")
print(cursor.rowcount , "records inserted")

db.commit()

3 records inserted

In [59]:
cursor.execute("INSERT INTO student1 VALUES(1,'jack' , 22 , 78) , (2 , 'john' , 21,56) , (3,'rudolf' , 12 ,78) , (4,'flick',24,6)")
print(cursor.rowcount , "records inserted")

db.commit()

4 records inserted

In [60]:
result = cursor.execute("select * from course1")
for row in result:
    print(row)

(78, 'data science', 12)
(56, 'python', 6)
(101, 'data base', 10)

In [61]:
result = cursor.execute("select * from student1")
for row in result:
    print(row)

(1, 'jack', 22, 78)
(2, 'john', 21, 56)
(3, 'rudolf', 12, 78)
(4, 'flick', 24, 6)

In [64]:
results = cursor.execute("select course_id from course1 where course_name = 'python'")
for i in result:
    print(i)

(56,)

In [66]:
results = cursor.execute("select course_id from course1 where course_name = 'data science'")
for i in result:
    print(i)

(78,)

In [67]:
cursor.execute('select * from student1 WHERE course_id =(select course_id from course1 where course_name = "data science")')
result.fetchall()

[(1, 'jack', 22, 78), (3, 'rudolf', 12, 78)]

In [68]:
cursor.execute('select * from student1 WHERE course_id =(select course_id from course1 where course_name = "data science")')
result.fetchone()

(1, 'jack', 22, 78)

In [69]:
cursor.execute('select * from student1 WHERE course_id =(select course_id from course1 where course_name = "python")')
result.fetchall()

[(2, 'john', 21, 56)]

# fetch record using wildcard:

# when we know only limited about our data but we need to fetch the record out of database then we use wildcard
for example we need to fetch jack and we only know that the name start with j and end with k then we used wildcard

In [70]:
#1.  %x = can start with any letter but end with only x (% is a wildcard it can be any letter)
#2.  x% = must start with letter x and can be end with any letter.
#3.  %x% = word must contain x anywhere inside the word. even it will first letter . even it is first letter it will still fetch

In [71]:
result = cursor.execute("select * from student1 where student_name like '%j%' ")
for i in result:
    print(i)

(1, 'jack', 22, 78)
(2, 'john', 21, 56)

In [72]:
result = cursor.execute("select * from student1 where student_name like '%a%' ")
for i in result:
    print(i)

(1, 'jack', 22, 78)

In [74]:
result = cursor.execute("select * from student1 where student_name like '%j' ")
for i in result:
    print(i)    #none of the name end with j

In [75]:
result = cursor.execute("select * from student1 where student_name like '%d%' ")
for i in result:
    print(i)

(3, 'rudolf', 12, 78)

# join 
different types of sql joins
(inner) join : return record that have matching values in both tables
left(outer) join: return all records from the left table and the matched record from the right table.
right(outer) join: return all records from the right table , and the matched records from the left side.
full(outer) join: return all record when there is a match in either left or right table

In [76]:
#Basically it is used to create a new table and join some or all  data from each table to create a nee table